{
  "creator": 1,
  "subscribers": [1, 9],
  "title": "React Developer",
  "header": "В разработке",
  "img": "/img/react.png",
  "text": "React - бибилотека для разработки пользовательских интерфейсов, созданная при поддержке Facebook, Instagram. Является одной из самых популярных библиотек в мире фронтенда. В данной специализации будет рассмотрен также Redux, Router и другие библиотеки.",
  "salary": "до 20000 руб.",
  "complexity": 3,
  "time": "4 месяца",
  "mentors": true,
  "interview": true,
  "cases": [
    {
      "title": "Гид по стране",
      "creator": 1,
      "text": "Бот навигатор по любой, выбранной вами стране. Содержит: информацию о стране, городах, о погоде, курсах валют, турах в страну и билетах."
    },
    {
      "title": "Платформа split-тестирования",
      "creator": 1,
      "text": "Веб-платорфма для сплит-тестирования. Клиент используя разработанную библиотеку получает информацию о конверсии на платформу. Информация представляется в виде графиков, таблиц."
    },
    {
      "title": "Расширение анонимизации",
      "creator": 1,
      "text": "Расширение, которое поможет анонимизровать работу клиента в бразуере: удаляя информацию о WebRTC, WebGL и других метках, с помощью которых можно сделать fingerprint."
    },
    {
      "title": "Почтовый сервис",
      "creator": 1,
      "text": "Почтовый сервис, который позволит делать рассылку по спискам email'ов, фильтровать данные списки и создавать шаблоны для отправки."
    },
    {
      "title": "Геймификация обучения",
      "creator": 1,
      "text": "Онлайн платформа, обучающая студента разработке с помощью геймификации. Например: ученик обучается программированию, управляя космическим кораблем."
    },
    {
      "title": "Кинотеатр с субтитрами",
      "creator": 1,
      "text": "Платформа видеоконтента с субтитрами, помогающими при изучении англиского языка."
    }
  ],
  "stages": [
    0,
    8,
    9,
    10,
    13,
    14,
    15,
    11,
    12
  ]
}
